InformationRegisters/СтатистикаИспользованияСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаИспользованияСервисов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Частота</Name>
					<Comment>Значение только 1 (еденица)!</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УниверсальнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>user_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтатистики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтатистики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСоСтатистикой_Сервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс
// Записать использования сервиса.
// 
// Параметры:
//  ВидСтатистики			 - ПеречислениеСсылка.ВидыСтатистики
//  СразуОтправитьВДатаЦентр - Булево
//	Частота 	 			 - Число - Частота использования текущего сервиса. По умолчанию = 1.  
Процедура ЗаписатьФактИспользованияСервиса(ВидСтатистики, СразуОтправитьВДатаЦентр = Ложь, Частота = 1) Экспорт
	ЗаписатьИспользованияСервисаВРегистр(ВидСтатистики, СразуОтправитьВДатаЦентр, Частота);
КонецПроцедуры

// Получить статистику.
// Параметры:
// ПолучатьПредставлениеСсылки - Булево
// 
// Возвращаемое значение:
//  Массив - Массив:
// * СтруктураДанныхСтатистики - Структура:
// * ПериодРегистрации - Дата 
// * УниверсальнаяДата - Дата
// * User_id 		   - УникальныйИдентификатор	
// * ЧасовойПояс       - Строка
// * ВидСтатистики 	   - ПеречислениеСсылка.ВидыСтатистики
// * Частота 		   - Число
// * Отправлено 	   - Булево
Функция ПолучитьСтатистику(ПолучатьПредставлениеСсылки) Экспорт
	Возврат РегистрыСведений.СтатистикаИспользованияСервисов.ПолучитьСтатистику(ПолучатьПредставлениеССылки);
КонецФункции

// Отправить статистику на сервер данных.
Процедура ОтправитьСтатистикуНаСерверДанных() Экспорт
	ВыгрузкаДанныхСервер.ВыгрузитьСтатистикуНаСервер();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьИспользованияСервисаВРегистр(ВидСтатистики, СразуОтправитьВДатаЦентр, Частота) Экспорт
	СтруктураДанных = СформироватьСтруктуруСтатистики();
	СтруктураДанных.ВидСтатистики = ВидСтатистики;
	СтруктураДанных.Частота = Частота;
	
	ОтветСервера = 666;
	Если СразуОтправитьВДатаЦентр Тогда
//			ТелоСтроки = СтрШаблон("date=%1;uDate=%2;GMT=%3;user_id=%4;typeStat=%5", XMLСтрока(СтруктураДанных.ПериодРегистрации), XMLСтрока(СтруктураДанных.УниверсальнаяДата), ЧасовойПояс(), СтруктураДанных.User_id, Перечисления.ВидыСтатистики.Индекс(ВидСтатистики));		
//			ОтветСервера = ЗапросыHTTP_Сервер.ОтправитьСтатистикуВДатаЦентр(ТелоСтроки);
	КонецЕсли;
	СтруктураДанных.Отправлено = ОтветСервера = 200;

	РегистрыСведений.СтатистикаИспользованияСервисов.ЗаписатьСтатистику(СтруктураДанных);
КонецПроцедуры

Функция СформироватьСтруктуруСтатистики()
	Возврат РегистрыСведений.СтатистикаИспользованияСервисов.СформироватьСтруктуруСтатистики();
КонецФункции
#КонецОбласти
